{
  "module": "mindset",
  "level_definitions": {
    "1": {
      "name": "Awareness",
      "description": "You're becoming aware that mindset can be developed",
      "capabilities": ["Recognize fixed vs growth mindset", "Notice negative self-talk", "Understand that thoughts aren't facts"],
      "milestone": "Catch yourself in a limiting belief and consciously reframe it"
    },
    "2": {
      "name": "Observer",
      "description": "Learning to observe thoughts without being controlled by them",
      "capabilities": ["Practice basic mindfulness", "Separate emotions from reactions", "Begin journaling practice"],
      "milestone": "10-day streak of morning journaling or meditation"
    },
    "3": {
      "name": "Reframer",
      "description": "Actively reframing challenges as opportunities",
      "capabilities": ["Use reframing techniques consistently", "Find the lesson in setbacks", "Maintain perspective during stress"],
      "milestone": "Successfully navigate a setback using Stoic principles"
    },
    "4": {
      "name": "Discipline Builder",
      "description": "Building discipline through consistent action",
      "capabilities": ["Do hard things voluntarily", "Keep promises to yourself", "Build confidence through action"],
      "milestone": "Complete 30 days of a challenging daily practice"
    },
    "5": {
      "name": "Resilient",
      "description": "Bouncing back quickly from adversity",
      "capabilities": ["Process emotions without being derailed", "Use the 40% rule when tired", "Embrace discomfort as growth"],
      "milestone": "Overcome a significant challenge without losing momentum"
    },
    "6": {
      "name": "Ownership Taker",
      "description": "Taking extreme ownership of all outcomes",
      "capabilities": ["No excuses mindset", "Lead yourself and others through challenges", "Take responsibility even when not 'your fault'"],
      "milestone": "Lead a difficult situation to success through ownership"
    },
    "7": {
      "name": "Antifragile",
      "description": "Growing stronger through volatility and stress",
      "capabilities": ["Seek challenges that build capability", "Thrive in uncertainty", "Turn obstacles into advantages"],
      "milestone": "Deliberately take on a challenge that scares you and grow from it"
    },
    "8": {
      "name": "Mental Athlete",
      "description": "Training your mind like an elite athlete trains their body",
      "capabilities": ["Consistent mental training practice", "Rapid emotional recovery", "Peak performance under pressure"],
      "milestone": "Perform at your best when it matters most"
    },
    "9": {
      "name": "Sage",
      "description": "Deep equanimity regardless of external circumstances",
      "capabilities": ["Maintain inner peace amid chaos", "Teach others mental resilience", "Integrate philosophy into daily life"],
      "milestone": "Navigate a major life challenge with grace and growth"
    },
    "10": {
      "name": "Mindset Master",
      "description": "Complete mastery over your inner world",
      "capabilities": ["Nothing disturbs your inner peace", "You elevate those around you", "Your presence calms and inspires"],
      "milestone": "Others seek you out for wisdom and perspective"
    }
  },
  "progressive_exercises": {
    "beginner": [
      {
        "title": "Limiting Belief Detector",
        "difficulty": 1,
        "time_minutes": 20,
        "instructions": "Write down 5 beliefs about yourself that might be limiting you. For each, ask: Is this absolutely true? What evidence contradicts it? What would change if I didn't believe this?",
        "success_criteria": "5 limiting beliefs identified with evidence against each"
      },
      {
        "title": "Gratitude Practice Starter",
        "difficulty": 1,
        "time_minutes": 10,
        "instructions": "Write 3 specific things you're grateful for today. Be specific: not 'family' but 'the conversation with mom that made me laugh.' Do this for 7 consecutive days.",
        "success_criteria": "7 days of specific gratitude entries (21 total items)"
      },
      {
        "title": "The Comfort Zone Map",
        "difficulty": 1,
        "time_minutes": 25,
        "instructions": "Draw three circles: Comfort Zone (things you do easily), Growth Zone (things that stretch you), Panic Zone (things that paralyze you). Identify one thing in Growth Zone to tackle this week.",
        "success_criteria": "Completed map with one Growth Zone action committed"
      }
    ],
    "intermediate": [
      {
        "title": "Stoic Morning Premeditatio",
        "difficulty": 2,
        "time_minutes": 15,
        "instructions": "Each morning for a week, spend 5 minutes imagining everything that could go wrong today. Then visualize handling each with equanimity. This removes the shock of difficulty and prepares you mentally.",
        "success_criteria": "7 days of premeditatio practice with reduced reactivity noted"
      },
      {
        "title": "Do Something That Sucks",
        "difficulty": 2,
        "time_minutes": 30,
        "instructions": "Identify something you've been avoiding because it's uncomfortable (cold shower, difficult conversation, hard workout). Do it. Document how you felt before, during, and after.",
        "success_criteria": "Completed avoided task with written reflection on the experience"
      },
      {
        "title": "The 40% Rule Test",
        "difficulty": 2,
        "time_minutes": 45,
        "instructions": "During your next challenging task (workout, work project, etc.), when you feel like quitting, recognize this is only 40% of your capacity. Push to 50%, then 60%. Track how far past 'done' you can go.",
        "success_criteria": "Successfully pushed past initial quitting point and documented the experience"
      },
      {
        "title": "The Letting Go Practice",
        "difficulty": 2,
        "time_minutes": 30,
        "instructions": "Identify something you're trying to force or control. For 30 minutes, consciously practice non-resistance. Use Alan Watts' approach: What if you stopped trying to grasp this outcome? What if you trusted the process? Write about what shifts when you stop forcing.",
        "success_criteria": "Identified area of resistance, practiced letting go, documented the shift in perspective"
      }
    ],
    "advanced": [
      {
        "title": "Extreme Ownership Audit",
        "difficulty": 3,
        "time_minutes": 60,
        "instructions": "Review a recent failure or setback. Instead of identifying external causes, write down every way YOU contributed to the outcome. How could you have anticipated and prevented issues? What will you do differently?",
        "success_criteria": "Honest ownership analysis with actionable changes identified"
      },
      {
        "title": "Fear-Setting Exercise",
        "difficulty": 3,
        "time_minutes": 45,
        "instructions": "Pick something you want but fear. Write: 1) What's the worst that could happen? 2) How could I prevent each? 3) How could I repair the damage? 4) What's the cost of inaction? 5) What are the benefits of success?",
        "success_criteria": "Complete fear-setting worksheet leading to action decision"
      },
      {
        "title": "Ego Dissolution Practice",
        "difficulty": 3,
        "time_minutes": 30,
        "instructions": "Identify an area where your ego is fragile (status, being right, looking smart). Deliberately put yourself in a situation where that ego gets challenged. Notice the resistance. Let it go.",
        "success_criteria": "Deliberately challenged ego and processed the experience constructively"
      },
      {
        "title": "Deep Shadow Integration",
        "difficulty": 3,
        "time_minutes": 60,
        "instructions": "Using Jung's shadow work: 1) List 5 people who trigger strong negative reactions in you. 2) For each, identify the trait you're judging. 3) Ask honestly: 'How does this trait exist in me?' 4) Write a dialogue with that shadow part using active imagination. 5) Identify one way to integrate this quality constructively.",
        "success_criteria": "Completed shadow exploration for all 5 triggers with honest self-reflection and integration plan"
      },
      {
        "title": "Present Moment Mastery Day",
        "difficulty": 3,
        "time_minutes": 480,
        "instructions": "For one full day, practice Alan Watts' approach: Whenever anxiety about the future or regret about the past arises, ask 'What problem do I have RIGHT NOW, in this moment?' Return to sensory awareness - breath, sounds, sights. Track how many times you catch yourself time-traveling mentally. Goal: 50+ catch-and-returns.",
        "success_criteria": "Tracked 50+ returns to present moment with reduced anxiety and increased presence by end of day"
      }
    ]
  },
  "cross_module_connections": [
    {
      "connected_module": "health",
      "insight": "Physical challenge builds mental resilience - the body and mind train together",
      "combined_exercise": "End every shower with 30 seconds of cold water. Use it as a daily Stoic practice - voluntary discomfort builds inner strength."
    },
    {
      "connected_module": "sales",
      "insight": "Rejection immunity is a mindset skill - reframe rejection as information, not personal failure",
      "combined_exercise": "Do Rejection Therapy: intentionally get rejected once per day for a week. Notice how the fear decreases."
    },
    {
      "connected_module": "productivity",
      "insight": "Resistance to hard work is mental, not physical - train your mind to embrace difficulty",
      "combined_exercise": "When you notice resistance to a task, say 'This is where I grow' and start a 25-minute timer."
    },
    {
      "connected_module": "money",
      "insight": "Most financial ceilings are mental - your beliefs about what's possible limit your income",
      "combined_exercise": "Write down your beliefs about money from childhood. Challenge each one: is this serving you or limiting you?"
    }
  ],
  "masters": [
    {
      "name": "Marcus Aurelius",
      "expertise": "Stoicism, self-discipline, duty",
      "key_principles": [
        "You have power over your mind, not outside events. Realize this, and you will find strength.",
        "The happiness of your life depends upon the quality of your thoughts.",
        "Waste no more time arguing about what a good man should be. Be one.",
        "Very little is needed to make a happy life; it is all within yourself.",
        "The best revenge is not to be like your enemy.",
        "When you arise in the morning think of what a privilege it is to be alive."
      ],
      "daily_practices": [
        "Morning reflection on what's in your control",
        "Evening review of your actions and thoughts",
        "Practice accepting what you cannot change"
      ],
      "worked_examples": [
        {
          "title": "Morning Stoic Practice",
          "scenario": "You wake up anxious about a difficult day ahead with meetings you're dreading.",
          "framework_applied": "Premeditatio Malorum + Control Dichotomy",
          "step_by_step": [
            "Before rising, visualize the day's challenges",
            "For each challenge, ask: What's in my control? What's not?",
            "For what's not in control: Practice acceptance now, not later",
            "For what's in control: Decide your response in advance",
            "Visualize yourself handling each difficulty with equanimity",
            "Rise with a mind prepared for anything",
            "End with: 'Today I may meet frustrating people. This is normal. My peace is internal.'"
          ],
          "outcome": "The day's challenges lose their power to disturb you because you've already mentally processed them."
        }
      ],
      "scripts_templates": [
        {
          "title": "Daily Stoic Journal Template",
          "context": "Use morning and evening for Stoic reflection and growth",
          "template": "MORNING REFLECTION:\n\nWhat's in my control today?\n- ___\n- ___\n- ___\n\nWhat's not in my control?\n- ___\n- ___\n\nWhat could go wrong? How will I respond with equanimity?\n- If ___, I will ___\n- If ___, I will ___\n\nWhat virtue will I practice today?\n- ___\n\n---\n\nEVENING REFLECTION:\n\nWhat went well today?\n- ___\n\nWhat could I have done better?\n- ___\n\nDid I respond to events with virtue?\n- ___\n\nWhat did I learn?\n- ___",
          "example_filled": "MORNING:\n\nIn my control:\n- My preparation for the presentation\n- How I respond to feedback\n- My attitude throughout\n\nNot in my control:\n- Whether they like my proposal\n- Technical issues\n\nIf the presentation fails, I will: Learn from the feedback and improve\nIf someone is hostile, I will: Respond with patience, not defensiveness\n\nVirtue today: Courage - speak my truth even if unpopular\n\n---\n\nEVENING:\n\nWent well: Stayed calm during tough questions\nBetter: Shouldn't have checked email during lunch, lost focus\nVirtuous: Yes, spoke honestly even when it was uncomfortable\nLearned: My anxiety is always worse than reality"
        },
        {
          "title": "Control Dichotomy Worksheet",
          "context": "Use when stressed or anxious about a situation",
          "template": "SITUATION: ___\n\nCOMPLETELY IN MY CONTROL:\n1. ___\n2. ___\n3. ___\n\nPARTIALLY IN MY CONTROL:\n1. ___ (What part is mine?)\n2. ___ (What part is mine?)\n\nNOT IN MY CONTROL AT ALL:\n1. ___\n2. ___\n3. ___\n\nACTION PLAN:\nFocus my energy on: ___\nAccept and release: ___\nMy peace does not depend on: ___",
          "example_filled": "SITUATION: Job interview tomorrow\n\nCOMPLETELY IN MY CONTROL:\n1. How well I prepare\n2. Getting good sleep tonight\n3. My attitude walking in\n\nPARTIALLY IN MY CONTROL:\n1. My performance (prep is mine, nerves partly aren't)\n2. Making a connection (my warmth is mine, their mood isn't)\n\nNOT IN MY CONTROL:\n1. Whether they like me\n2. What other candidates are like\n3. Their internal politics\n\nACTION PLAN:\nFocus on: Preparation and being my authentic self\nAccept: The outcome is not up to me\nMy peace does not depend on: Getting this specific job"
        }
      ],
      "resources": {
        "books": [
          {"title": "Meditations", "author": "Marcus Aurelius", "key_takeaway": "Private journal of a Roman emperor practicing Stoic philosophy"},
          {"title": "The Daily Stoic", "author": "Ryan Holiday", "key_takeaway": "366 meditations on wisdom, perseverance, and the art of living"}
        ],
        "podcasts": [
          {"title": "The Daily Stoic Podcast", "key_takeaway": "Daily 5-minute Stoic wisdom for modern life"}
        ]
      }
    },
    {
      "name": "David Goggins",
      "expertise": "Mental toughness, extreme accountability, embracing suffering",
      "key_principles": [
        "You are in danger of living a life so comfortable and soft that you will die without ever realizing your potential.",
        "The only way to grow is to go to that dark place and get after it.",
        "Most people stop at 40% of their capacity. The brain lies to protect you.",
        "Suffering is a test. How you handle it determines who you become.",
        "Nobody cares what you did yesterday. What are you doing today?",
        "Callus your mind. Embrace the suck."
      ],
      "daily_practices": [
        "Do something that sucks every single day",
        "When your mind says stop, do 10 more",
        "Hold yourself accountable with radical honesty"
      ],
      "worked_examples": [
        {
          "title": "The 40% Rule Application",
          "scenario": "You're in a workout and everything in you wants to quit.",
          "framework_applied": "The 40% Rule + Callusing Your Mind",
          "step_by_step": [
            "Recognize the moment: Your brain is telling you to stop",
            "Understand: This is a protection mechanism. You're only at 40%.",
            "Override: Tell yourself 'This is where I grow'",
            "Take one more step, do one more rep, go one more minute",
            "Bank this experience: Each time you override, you callus your mind",
            "The more you do this, the further your 40% point moves",
            "Eventually, discomfort becomes a signal to lean in, not quit"
          ],
          "outcome": "Your capacity expands dramatically because you learn to operate past the brain's comfort governor."
        }
      ],
      "scripts_templates": [
        {
          "title": "Accountability Mirror Script",
          "context": "Use daily to have a brutally honest conversation with yourself",
          "template": "Look in the mirror. Answer honestly:\n\n1. What did I do yesterday that I'm proud of?\n   ___\n\n2. What did I avoid or make excuses about?\n   ___\n\n3. What lie am I telling myself?\n   ___\n\n4. What's the hard thing I know I should do but don't want to?\n   ___\n\n5. Am I living up to my potential right now?\n   ___\n\n6. What would the best version of me do today?\n   ___\n\nNOW: Commit to one hard thing today.\nI WILL: ___",
          "example_filled": "1. Proud of: Got up early and trained despite not wanting to\n\n2. Avoided: That hard conversation with my partner about finances\n\n3. Lie I'm telling myself: 'I'll start the business next month when things calm down'\n\n4. Hard thing I should do: Make that sales call I've been putting off\n\n5. Living up to potential: No. I'm coasting when I should be pushing.\n\n6. Best version would: Make the calls, have the conversation, stop hiding.\n\nI WILL: Make 10 sales calls before noon. No excuses."
        },
        {
          "title": "Suffering as Growth Framework",
          "context": "Use when facing a difficult challenge",
          "template": "THE CHALLENGE: ___\n\nMY NATURAL RESPONSE: (avoidance, complaint, etc.)\n___\n\nREFRAME:\n- This suffering is: ___\n- What I'll gain from embracing it: ___\n- Who I'll become by going through it: ___\n\nTHE 40% CHECK:\n- My brain says I'm done at: ___%\n- The truth is I have: ___% more\n\nCOMMIT:\nI will not quit because: ___\n\nMANTRA:\n'___'",
          "example_filled": "THE CHALLENGE: Training for a marathon with no running background\n\nNATURAL RESPONSE: 'This is too hard, I'm not a runner, maybe next year'\n\nREFRAME:\n- This suffering is: An opportunity to prove what I'm capable of\n- What I'll gain: Physical capability + mental proof that I can do hard things\n- Who I'll become: Someone who follows through on commitments to themselves\n\nTHE 40% CHECK:\n- My brain says I'm done at: 3 miles in\n- The truth is I have: 60% more if I push through\n\nCOMMIT:\nI will not quit because: The person I want to become runs marathons, and that person starts today.\n\nMANTRA:\n'Stay hard.'"
        }
      ],
      "resources": {
        "books": [
          {"title": "Can't Hurt Me", "author": "David Goggins", "key_takeaway": "Master your mind and defy the odds"},
          {"title": "Never Finished", "author": "David Goggins", "key_takeaway": "Unshackle your mind and win the war within"}
        ],
        "podcasts": [
          {"title": "David Goggins on Joe Rogan", "key_takeaway": "Raw, unfiltered conversation about mental toughness"}
        ]
      }
    },
    {
      "name": "Jocko Willink",
      "expertise": "Extreme ownership, discipline, leadership",
      "key_principles": [
        "Discipline equals freedom.",
        "Extreme ownership: There are no bad teams, only bad leaders.",
        "Don't let your ego get in the way of learning.",
        "Prioritize and execute. Focus on the biggest problem first.",
        "Default aggressive. When in doubt, take action.",
        "Check the ego. The moment you think you know everything, you know nothing."
      ],
      "daily_practices": [
        "Wake up early. Win the first battle.",
        "Take ownership of every problem in your life",
        "Make discipline your identity, not a chore"
      ],
      "worked_examples": [
        {
          "title": "Applying Extreme Ownership",
          "scenario": "A project at work failed and there are many people/factors you could blame.",
          "framework_applied": "Extreme Ownership",
          "step_by_step": [
            "Resist the urge to blame: Notice any thought that points outward",
            "Ask: What could I have done to prevent this?",
            "Could I have communicated more clearly? Set better expectations?",
            "Could I have anticipated the problem and mitigated it?",
            "Could I have checked in earlier when I sensed issues?",
            "Take 100% ownership publicly: 'This was my fault. Here's what I'm doing differently.'",
            "This earns respect and actually solves problems"
          ],
          "outcome": "Problems get solved faster when someone owns them. Your team respects you more. You improve faster."
        }
      ],
      "scripts_templates": [
        {
          "title": "Extreme Ownership Debrief",
          "context": "Use after any setback or failure",
          "template": "SITUATION: ___\n\nOUTCOME: ___\n\nEASY EXCUSES (things I could blame):\n1. ___\n2. ___\n3. ___\n\nEXTREME OWNERSHIP (how I contributed):\n1. ___\n2. ___\n3. ___\n\nWHAT I WILL DO DIFFERENTLY:\n1. ___\n2. ___\n3. ___\n\nLESSON I'M TAKING FORWARD:\n___",
          "example_filled": "SITUATION: Product launch missed the deadline by 2 weeks\n\nOUTCOME: Lost market window, CEO unhappy, team demoralized\n\nEASY EXCUSES:\n1. The dev team underestimated complexity\n2. Marketing changed requirements mid-project\n3. We didn't have enough resources\n\nEXTREME OWNERSHIP:\n1. I didn't verify the estimate with enough detail\n2. I should have frozen requirements earlier\n3. I could have raised the resource issue sooner\n\nWHAT I'LL DO DIFFERENTLY:\n1. Do technical deep-dives on estimates before committing\n2. Set hard requirement freeze dates and enforce them\n3. Raise resource concerns immediately, not politely\n\nLESSON: If I see a problem coming, it's my job to fix it, not hope it fixes itself."
        },
        {
          "title": "Discipline = Freedom Daily Framework",
          "context": "Structure your day around discipline creating freedom",
          "template": "FREEDOM I WANT: ___\n\nDISCIPLINE REQUIRED:\n- Daily: ___\n- Weekly: ___\n- Monthly: ___\n\nMORNING ROUTINE (non-negotiable):\nWake time: ___\nFirst action: ___\nWin before others wake: ___\n\nTHE HARD THING I'M AVOIDING:\n___\n\nI WILL DO IT BECAUSE:\n___\n\nIF I FAIL TO EXECUTE, MY EXCUSE WILL BE:\n___\n\nTHAT EXCUSE IS: [ ] Valid [ ] BS",
          "example_filled": "FREEDOM I WANT: Financial independence by 45\n\nDISCIPLINE REQUIRED:\n- Daily: 2 hours of focused work on side business before day job\n- Weekly: Review metrics, adjust approach\n- Monthly: Evaluate strategy, cut what's not working\n\nMORNING ROUTINE:\nWake: 4:30am\nFirst action: Coffee, then immediately to desk\nWin: Complete 2 hours of focused work before 7am\n\nHARD THING I'M AVOIDING:\nMaking sales calls - fear of rejection\n\nI WILL DO IT BECAUSE:\nFreedom requires revenue, revenue requires sales\n\nIF I FAIL, MY EXCUSE: 'I was too tired, I needed more sleep'\n\nTHAT EXCUSE IS: [x] BS"
        }
      ],
      "resources": {
        "books": [
          {"title": "Extreme Ownership", "author": "Jocko Willink & Leif Babin", "key_takeaway": "How U.S. Navy SEALs lead and win - applicable to all of life"},
          {"title": "Discipline Equals Freedom", "author": "Jocko Willink", "key_takeaway": "Field manual for living a disciplined life"}
        ],
        "podcasts": [
          {"title": "Jocko Podcast", "key_takeaway": "Discipline, leadership, and mental toughness from a Navy SEAL"}
        ]
      }
    },
    {
      "name": "Carol Dweck",
      "expertise": "Growth mindset, learning, resilience",
      "key_principles": [
        "In a growth mindset, challenges are exciting rather than threatening.",
        "Becoming is better than being.",
        "The passion for stretching yourself and sticking to it, even when it's not going well, is the hallmark of the growth mindset.",
        "No matter what your ability is, effort is what ignites that ability and turns it into accomplishment.",
        "Just because some people can do something with little or no training doesn't mean others can't do it with training.",
        "Effort is one of those things that gives meaning to life."
      ],
      "daily_practices": [
        "Add 'yet' to any 'I can't' statement",
        "Celebrate effort, not just results",
        "Seek challenges that stretch you"
      ],
      "worked_examples": [
        {
          "title": "Converting Fixed to Growth Mindset",
          "scenario": "You receive critical feedback and your first reaction is to feel attacked and defensive.",
          "framework_applied": "Fixed vs Growth Mindset Reframe",
          "step_by_step": [
            "Notice the fixed mindset reaction: 'They don't understand, this is unfair'",
            "Recognize this is a protection mechanism for your ego",
            "Ask: 'What can I learn from this feedback?'",
            "Reframe: 'This feedback shows where I can grow'",
            "Thank the person for their input (this is hard but powerful)",
            "Identify one specific action to improve based on feedback",
            "Your ability isn't fixed - it's being developed"
          ],
          "outcome": "Feedback becomes fuel for growth rather than an attack on identity. Improvement accelerates."
        }
      ],
      "scripts_templates": [
        {
          "title": "Growth Mindset Reframe Checklist",
          "context": "Use when you notice fixed mindset thinking",
          "template": "TRIGGER THOUGHT (fixed mindset):\n'___'\n\nCHECK - IS THIS FIXED MINDSET?\n[ ] 'I'm not good at this' (vs 'I'm not good at this YET')\n[ ] 'I failed' (vs 'I learned what doesn't work')\n[ ] 'This is too hard' (vs 'This will take effort and practice')\n[ ] 'I'm not a ___ person' (vs 'I haven't developed this skill')\n[ ] 'If I have to try hard, I must not be talented'\n\nGROWTH MINDSET REFRAME:\n'___'\n\nACTION THIS ENABLES:\n___",
          "example_filled": "TRIGGER THOUGHT:\n'I'm just not a math person'\n\nCHECK:\n[x] 'I'm not good at this' - YES, this is fixed mindset\n\nGROWTH MINDSET REFRAME:\n'I haven't spent time developing my math skills yet. With practice, I can improve.'\n\nACTION THIS ENABLES:\nStart a daily 15-minute math practice. Focus on progress, not perfection."
        }
      ],
      "resources": {
        "books": [
          {"title": "Mindset: The New Psychology of Success", "author": "Carol Dweck", "key_takeaway": "The difference between fixed and growth mindsets and how to change"}
        ],
        "podcasts": [
          {"title": "Carol Dweck on The Knowledge Project", "key_takeaway": "Deep dive into growth mindset research and application"}
        ]
      }
    },
    {
      "name": "Ryan Holiday",
      "expertise": "Stoicism, obstacle as the way, ego management",
      "key_principles": [
        "The obstacle is the way. What stands in the way becomes the way.",
        "Ego is the enemy. It's the voice that tells you you're special, you're better.",
        "Stillness is the key. In stillness, we find clarity.",
        "You don't control events, but you control how you respond.",
        "Perception, action, will. That's the stoic formula.",
        "Alive time or dead time. You choose."
      ],
      "daily_practices": [
        "Reframe every obstacle as an opportunity",
        "Practice stillness for 10 minutes daily",
        "Journal about your perceptions and responses"
      ],
      "worked_examples": [
        {
          "title": "The Obstacle Is The Way Applied",
          "scenario": "You lose your job unexpectedly and feel devastated.",
          "framework_applied": "Perception, Action, Will",
          "step_by_step": [
            "PERCEPTION: Reframe the situation. This isn't just a loss - it's an opening.",
            "Ask: What opportunity does this create that didn't exist before?",
            "ACTION: What can I do right now with this new situation?",
            "Could I start the business I've been putting off? Relocate? Pivot careers?",
            "WILL: Accept what happened. Don't waste energy wishing it were different.",
            "Use the obstacle: The job ending might be the push you needed.",
            "Choose alive time: Every day you're learning and moving forward, not bitter and stuck."
          ],
          "outcome": "What felt like a disaster becomes a defining positive chapter when you use the obstacle instead of being crushed by it."
        }
      ],
      "scripts_templates": [
        {
          "title": "Fear-Setting Worksheet (Tim Ferriss/Stoic)",
          "context": "Use when fear is preventing you from taking action",
          "template": "WHAT I'M AFRAID TO DO:\n___\n\nDEFINE THE NIGHTMARE (What's the worst that could realistically happen?):\n1. ___\n2. ___\n3. ___\n\nPREVENT (What could I do to prevent each?):\n1. ___\n2. ___\n3. ___\n\nREPAIR (If the worst happened, how could I fix it?):\n1. ___\n2. ___\n3. ___\n\nCOST OF INACTION (What am I losing by not acting?):\n- In 6 months: ___\n- In 1 year: ___\n- In 3 years: ___\n\nBENEFITS OF SUCCESS (What could I gain?):\n1. ___\n2. ___\n3. ___\n\nDECISION: ___",
          "example_filled": "WHAT I'M AFRAID TO DO:\nQuit my job to start my own business\n\nNIGHTMARE:\n1. Run out of money in 6 months\n2. Business fails completely\n3. Can't get a job again\n\nPREVENT:\n1. Save 12 months expenses before quitting\n2. Test the business while employed\n3. Keep skills current, maintain network\n\nREPAIR:\n1. Could get a consulting gig quickly\n2. The experience makes me more hireable\n3. Network would help me find something\n\nCOST OF INACTION:\n- 6 months: More time lost, more regret\n- 1 year: Still dreaming instead of doing\n- 3 years: Will hate myself for not trying\n\nBENEFITS OF SUCCESS:\n1. Freedom and control of my time\n2. Unlimited income potential\n3. Building something meaningful\n\nDECISION: Do it. The cost of inaction exceeds the worst case."
        }
      ],
      "resources": {
        "books": [
          {"title": "The Obstacle Is the Way", "author": "Ryan Holiday", "key_takeaway": "The timeless art of turning trials into triumph"},
          {"title": "Ego Is the Enemy", "author": "Ryan Holiday", "key_takeaway": "How ego prevents success and how to overcome it"},
          {"title": "Stillness Is the Key", "author": "Ryan Holiday", "key_takeaway": "Finding peace and clarity in a noisy world"}
        ],
        "podcasts": [
          {"title": "The Daily Stoic Podcast", "key_takeaway": "Daily practical Stoic wisdom"}
        ]
      }
    },
    {
      "name": "Nassim Taleb",
      "expertise": "Antifragility, uncertainty, skin in the game",
      "key_principles": [
        "Antifragile: Some things benefit from shocks; they thrive and grow when exposed to volatility.",
        "Wind extinguishes a candle and energizes fire. Be the fire.",
        "The best way to verify that you are alive is by checking if you like variations.",
        "If you want to accelerate someone's death, give them a personal doctor.",
        "Never trust anyone who doesn't have skin in the game.",
        "The three most harmful addictions are heroin, carbohydrates, and a monthly salary."
      ],
      "daily_practices": [
        "Expose yourself to small stressors daily",
        "Build redundancy and options in your life",
        "Avoid fragile dependencies"
      ],
      "worked_examples": [
        {
          "title": "Building an Antifragile Life",
          "scenario": "You realize your entire life depends on one job, one income source, one set of skills.",
          "framework_applied": "Antifragility + Via Negativa",
          "step_by_step": [
            "Assess fragility: Where would a shock break you?",
            "Build redundancy: Multiple income sources, diverse skills, strong network",
            "Add optionality: Increase options, decrease obligations",
            "Introduce stressors: Voluntary hardship builds resilience",
            "Via negativa: Remove fragilities before adding new things",
            "Embrace variation: Monotony is fragile, variation is antifragile",
            "Skin in the game: Take risks where you bear the consequences"
          ],
          "outcome": "Each shock makes you stronger because you've built systems that benefit from volatility."
        }
      ],
      "scripts_templates": [
        {
          "title": "Fragility Audit",
          "context": "Identify and reduce your life's fragilities",
          "template": "AREA: Career\n- Single point of failure: ___\n- How to build redundancy: ___\n\nAREA: Income\n- Single point of failure: ___\n- How to build redundancy: ___\n\nAREA: Health\n- Single point of failure: ___\n- How to build redundancy: ___\n\nAREA: Relationships\n- Single point of failure: ___\n- How to build redundancy: ___\n\nBIGGEST FRAGILITY: ___\nFIRST ACTION TO REDUCE IT: ___",
          "example_filled": "AREA: Career\n- Single point of failure: Entire income from one employer\n- Redundancy: Develop freelance skills, build network, create side income\n\nAREA: Income\n- Single point of failure: 100% salary-dependent\n- Redundancy: Investment income, side business, emergency fund\n\nAREA: Health\n- Single point of failure: Sedentary job, poor diet habits\n- Redundancy: Daily movement practice, meal prep, regular checkups\n\nAREA: Relationships\n- Single point of failure: No community outside work\n- Redundancy: Invest in friendships, join groups, nurture family ties\n\nBIGGEST FRAGILITY: 100% income from job\nFIRST ACTION: Start freelancing 5 hours/week to build alternative income"
        }
      ],
      "resources": {
        "books": [
          {"title": "Antifragile", "author": "Nassim Taleb", "key_takeaway": "Things that gain from disorder"},
          {"title": "Skin in the Game", "author": "Nassim Taleb", "key_takeaway": "Hidden asymmetries in daily life"}
        ],
        "podcasts": [
          {"title": "Nassim Taleb on EconTalk", "key_takeaway": "Applied antifragility and risk thinking"}
        ]
      }
    },
    {
      "name": "Alan Watts",
      "expertise": "Eastern philosophy, Zen, living in the present",
      "key_principles": [
        "You are the universe experiencing itself.",
        "The meaning of life is just to be alive. It is so plain and obvious.",
        "We suffer because we cling to what is impermanent.",
        "The only way to make sense out of change is to plunge into it, move with it, and join the dance.",
        "Life is not a problem to be solved, but a reality to be experienced.",
        "Trying to define yourself is like trying to bite your own teeth."
      ],
      "daily_practices": [
        "Spend 10 minutes in pure observation - no judgment, just presence",
        "Notice when you're resisting what is, and let go",
        "Ask: 'Am I living, or just thinking about living?'"
      ],
      "worked_examples": [
        {
          "title": "The Art of Letting Go",
          "scenario": "You're anxious about the future and can't be present.",
          "framework_applied": "Watts' Present Moment Awareness",
          "step_by_step": [
            "Notice: You're living in a future that doesn't exist yet",
            "Ask yourself: 'What problem do I have right now, in this moment?'",
            "Usually the answer is: Nothing. The problems are in your imagination of the future.",
            "This moment, right now, is all you have. Past is memory. Future is imagination.",
            "Practice: Feel your breath. Notice sounds. See colors. Be here.",
            "When anxiety returns, gently ask: 'Am I here now, or in an imaginary future?'",
            "The goal isn't to stop planning. It's to stop suffering about what hasn't happened."
          ],
          "outcome": "Anxiety decreases because you're not mentally time-traveling. Life is happening now, and now is manageable."
        },
        {
          "title": "Ego and the Illusion of Separation",
          "scenario": "You feel isolated, separate from others, and competitive.",
          "framework_applied": "Watts' Non-Duality",
          "step_by_step": [
            "Recognize: The 'separate self' is a useful fiction, not ultimate reality",
            "You are not a separate entity observing the world. You ARE the world.",
            "Think of a wave in the ocean. Is it separate from the ocean? Or is it the ocean waving?",
            "You are the universe expressing itself at this location, through this body",
            "Competition dissolves: If we're all the same thing, who's competing with whom?",
            "Connection deepens: Every person is you in a different form",
            "This doesn't mean losing your individuality. It means understanding its context."
          ],
          "outcome": "Loneliness and separation fade. You feel fundamentally connected to everything. Ego games seem pointless."
        }
      ],
      "scripts_templates": [
        {
          "title": "Present Moment Anchor",
          "context": "Use when anxious about future or stuck in past",
          "template": "WHEN MIND WANDERS:\nWhere is my mind right now? [ ] Past [ ] Future [ ] Present\n\nASK:\n'What problem do I have RIGHT NOW, in this moment?'\n___\n\nRETURN TO NOW:\nWhat do I see? ___\nWhat do I hear? ___\nWhat do I feel physically? ___\nWhat is my breath doing? ___\n\nRECOGNIZE:\nThis moment is: [ ] Manageable [ ] Okay [ ] Actually fine\nThe suffering was about: [ ] Past [ ] Future [ ] Story I'm telling\n\nPRACTICE:\nI don't need to fix anything right now. I just need to be here.",
          "example_filled": "WHERE IS MY MIND:\n[x] Future (worried about tomorrow's presentation)\n\nASK:\nWhat problem right now? None. I'm sitting comfortably, safe, fine.\n\nRETURN:\nSee: Sunlight through window, book on table\nHear: Birds, distant traffic\nFeel: Chair supporting me, relaxed muscles\nBreath: Steady, calm\n\nRECOGNIZE:\nThis moment is: [x] Actually fine\nSuffering was about: [x] Future [x] Story ('I'll fail')\n\nPRACTICE:\nThe presentation will happen when it happens. Right now, there's nothing to fix. I'm here. It's okay."
        },
        {
          "title": "Letting Go Practice",
          "context": "Use when clinging to outcomes or resisting reality",
          "template": "WHAT AM I CLINGING TO?\n___\n\nWHY AM I CLINGING?\nWhat do I think will happen if I let go? ___\n\nWHAT IS THE REALITY I'M RESISTING?\n___\n\nWHAT WOULD ACCEPTANCE LOOK LIKE?\n___\n\nWATTS' QUESTION:\n'What would you do if you had nothing to lose and nothing to gain?'\n___\n\nLET GO:\nI release my grip on: ___\nI accept that: ___\nI trust that: ___\n\nNOW WHAT?\nWith open hands, what action feels right? ___",
          "example_filled": "CLINGING TO:\nThe relationship working out exactly as I imagined\n\nWHY:\nIf I let go, it might end. I'll be alone. I've invested so much.\n\nREALITY I'M RESISTING:\nThe relationship is changing. My partner is changing. I'm changing. Clinging is causing suffering.\n\nACCEPTANCE:\nLetting this relationship evolve naturally, even if it ends. Trusting the process.\n\nIF NOTHING TO LOSE/GAIN:\nI'd communicate honestly, stop people-pleasing, be authentic, and trust that whatever happens is right.\n\nLET GO:\nRelease: My rigid picture of 'how it should be'\nAccept: Change is constant, control is illusory\nTrust: Whatever happens will lead where I need to go\n\nNOW:\nHave an honest conversation about what we both need. No manipulation, just truth."
        }
      ],
      "resources": {
        "books": [
          {"title": "The Way of Zen", "author": "Alan Watts", "key_takeaway": "Introduction to Zen Buddhism and Eastern philosophy"},
          {"title": "The Wisdom of Insecurity", "author": "Alan Watts", "key_takeaway": "How to find peace in a world of constant change"}
        ],
        "podcasts": [
          {"title": "Alan Watts Audio Collection", "key_takeaway": "Lectures on philosophy, life, and consciousness"}
        ]
      }
    },
    {
      "name": "Carl Jung",
      "expertise": "Depth psychology, shadow work, archetypes, individuation",
      "key_principles": [
        "Until you make the unconscious conscious, it will direct your life and you will call it fate.",
        "The shadow is the person you'd rather not be. Integrate it or it will sabotage you.",
        "We meet ourselves time and again in a thousand disguises on the path of life.",
        "The meeting of two personalities is like the contact of two chemical substances: if there is any reaction, both are transformed.",
        "Your vision will become clear only when you look into your heart. Who looks outside, dreams. Who looks inside, awakens.",
        "I am not what happened to me, I am what I choose to become."
      ],
      "daily_practices": [
        "Shadow journaling: What did I judge harshly today? That's my shadow.",
        "Notice projections: What I criticize in others lives in me",
        "Active imagination: Dialogue with the parts of yourself you reject"
      ],
      "worked_examples": [
        {
          "title": "Shadow Work: Integrating What You Reject",
          "scenario": "You keep getting triggered by the same type of person or behavior.",
          "framework_applied": "Jungian Shadow Integration",
          "step_by_step": [
            "Notice strong reactions: What triggers rage, disgust, or judgment?",
            "These reactions point to your shadow: the disowned parts of yourself",
            "Example: You hate 'lazy' people. The shadow: Your own desire to rest.",
            "Or: You judge 'selfish' people. The shadow: Your own unmet needs.",
            "Ask: 'How am I this thing I judge?' Be honest.",
            "The traits you reject in yourself, you project onto others",
            "Integration: 'I contain this too. How can I accept and integrate it?'",
            "Not acting on every impulse, but acknowledging all parts exist in you"
          ],
          "outcome": "You stop being triggered because you've acknowledged the shadow. Other people become less annoying because you've stopped projecting."
        },
        {
          "title": "Working with Archetypes",
          "scenario": "You feel stuck playing the same role in life and relationships.",
          "framework_applied": "Jungian Archetypes",
          "step_by_step": [
            "Identify your dominant archetype: What role do you always play?",
            "Common archetypes: Hero, Caregiver, Sage, Rebel, Lover, Ruler",
            "Example: You always play the Caregiver - rescuing, fixing, sacrificing",
            "Ask: What's the gift of this archetype? (Compassion, service)",
            "Ask: What's the shadow side? (Martyrdom, resentment, burnout)",
            "What archetype am I suppressing? (Maybe the Rebel - your own needs)",
            "Integration: Develop the suppressed archetype consciously",
            "Example: Practice the Rebel - say no, set boundaries, be 'selfish'"
          ],
          "outcome": "You become whole by integrating multiple archetypes. You're not stuck playing one role forever."
        },
        {
          "title": "The Individuation Process",
          "scenario": "You're living according to others' expectations, not your own truth.",
          "framework_applied": "Jung's Individuation - Becoming Who You Really Are",
          "step_by_step": [
            "First half of life: Building ego, achieving, following the script society gave you",
            "Mid-life crisis: Realizing the script doesn't fit. Who am I really?",
            "Individuation: The process of becoming your authentic self",
            "Step 1: Confront the persona (the mask you show the world). Who are you without it?",
            "Step 2: Integrate the shadow (the parts you've rejected)",
            "Step 3: Dialogue with anima/animus (the contrasexual side - feeling vs logic)",
            "Step 4: Meet the Self (the totality of who you are, beyond ego)",
            "This is a lifelong process, not a destination"
          ],
          "outcome": "You stop living someone else's life. You make choices from your core self, not from conditioning."
        }
      ],
      "scripts_templates": [
        {
          "title": "Shadow Work Journal",
          "context": "Daily practice to identify and integrate shadow",
          "template": "WHAT TRIGGERED ME TODAY?\n___\n\nWHO/WHAT DID I JUDGE HARSHLY?\n___\n\nWHAT TRAIT DID I REACT TO?\n___\n\nHOW AM I LIKE THIS?\n(Be honest. Where does this trait live in me?)\n___\n\nWHAT IS THIS SHADOW TRYING TO TELL ME?\n___\n\nHOW CAN I INTEGRATE THIS PART?\n___\n\nCOMPLETION:\nI acknowledge that I contain: ___\nI accept that this is part of being human.\nI will honor this part by: ___",
          "example_filled": "TRIGGERED BY:\nColleague who talks constantly about their achievements\n\nJUDGED:\nThey're arrogant, self-centered, annoying\n\nTRAIT:\nSelf-promotion, need for recognition\n\nHOW AM I LIKE THIS:\nI want recognition too but I'm 'too humble' to ask. I wait for others to notice, then resent when they don't.\n\nSHADOW MESSAGE:\nYou have needs for recognition that you're not acknowledging. You judge them for doing what you won't let yourself do.\n\nINTEGRATE:\nI can advocate for myself without being arrogant. I can share wins without waiting for permission.\n\nCOMPLETION:\nI contain: The need for recognition and validation\nHonor it by: Sharing one win per week, owning my achievements"
        },
        {
          "title": "Archetype Exploration",
          "context": "Understand which archetypal energies you embody",
          "template": "MY DOMINANT ARCHETYPE:\n___\n\nGIFTS OF THIS ARCHETYPE:\n1. ___\n2. ___\n3. ___\n\nSHADOW SIDE:\n1. ___\n2. ___\n3. ___\n\nWHEN DO I OVERPLAY THIS ROLE?\n___\n\nWHAT ARCHETYPE AM I SUPPRESSING?\n___\n\nWHAT WOULD IT LOOK LIKE TO DEVELOP THAT?\n___\n\nINTEGRATION PRACTICE:\nThis week I will embody [suppressed archetype] by:\n___",
          "example_filled": "DOMINANT: Caregiver\n\nGIFTS:\n1. Compassionate, people feel safe with me\n2. Good at supporting others\n3. Create harmony\n\nSHADOW:\n1. Resentment when needs aren't reciprocated\n2. Burnout from over-giving\n3. Enabling others' helplessness\n\nOVERPLAY:\nWhen I sacrifice my needs to avoid conflict. When I rescue instead of letting people learn.\n\nSUPPRESSING:\nThe Warrior - assertiveness, boundaries, healthy conflict\n\nDEVELOP WARRIOR:\nSet clear boundaries, say no without guilt, stand up for myself\n\nPRACTICE:\nThis week: Say no to one request without over-explaining. Have one difficult conversation I've been avoiding."
        },
        {
          "title": "Active Imagination Dialogue",
          "context": "Conversation with a disowned part of yourself",
          "template": "THE PART I'M TALKING TO:\n___\n\nME: Why do you show up in my life?\nTHEM: ___\n\nME: What do you want from me?\nTHEM: ___\n\nME: What are you trying to protect me from?\nTHEM: ___\n\nME: What would happen if I integrated you?\nTHEM: ___\n\nME: What do you need from me?\nTHEM: ___\n\nME: How can we work together?\nTHEM: ___\n\nREFLECTION:\nWhat I learned: ___\nWhat changes now: ___",
          "example_filled": "THE PART: My Inner Rebel\n\nME: Why show up?\nREBEL: You're living in a cage of your own making. Following rules that don't serve you.\n\nME: What do you want?\nREBEL: Freedom. Authenticity. For you to stop people-pleasing.\n\nME: Protecting me from?\nREBEL: You're trying to protect yourself from rejection by being 'good'. I'm here to remind you that approval isn't worth your soul.\n\nME: If I integrated you?\nREBEL: You'd live more honestly. You'd disappoint some people and find your real tribe.\n\nME: What do you need?\nREBEL: Permission. Listen to me sometimes instead of always the Conformist.\n\nME: Work together how?\nREBEL: Check in with me before saying yes to things. I'll tell you when you're betraying yourself.\n\nLEARNED:\nMy rebellion isn't bad - it's trying to save me from a life of inauthenticity.\n\nCHANGES:\nI'll pause before automatically agreeing to things. Check with Inner Rebel first."
        }
      ],
      "resources": {
        "books": [
          {"title": "Man and His Symbols", "author": "Carl Jung", "key_takeaway": "Introduction to Jungian psychology and the unconscious"},
          {"title": "Owning Your Own Shadow", "author": "Robert A. Johnson", "key_takeaway": "Practical guide to Jungian shadow work"}
        ],
        "podcasts": [
          {"title": "This Jungian Life", "key_takeaway": "Applying Jungian concepts to modern life"}
        ]
      }
    }
  ],
  "daily_insights": [
    "Your thoughts create your reality. Guard them like a fortress.",
    "Comfort is the enemy of progress. Seek discomfort daily.",
    "You're not your emotions. You're the observer of your emotions.",
    "Every setback is a setup for a comeback. Reframe everything.",
    "The quality of your questions determines the quality of your life.",
    "Discipline is choosing what you want most over what you want now.",
    "Your identity drives your behavior. Change who you are, change what you do.",
    "Pain is inevitable. Suffering is optional. It's how you interpret the pain.",
    "Confidence comes from kept promises to yourself. Keep small promises daily.",
    "The obstacle is not in your way. It is the way.",
    "What you resist persists. Let go of the struggle and flow with what is.",
    "The shadow you refuse to face will sabotage your life until you integrate it.",
    "You are not separate from the universe - you are the universe experiencing itself.",
    "The more you try to grasp happiness, the more it slips away. Stop chasing, start being.",
    "Every person who triggers you is showing you a disowned part of yourself."
  ],
  "skill_challenges": [
    "Do one thing today that scares you.",
    "Take a cold shower. Embrace the discomfort.",
    "Journal for 10 minutes: What am I avoiding and why?",
    "Identify one limiting belief. Write down evidence against it.",
    "Go 24 hours without complaining. Notice how often you want to.",
    "Do something uncomfortable for someone else today.",
    "Meditate for 10 minutes. Just observe your thoughts.",
    "Write down 3 things you're grateful for. Be specific.",
    "Identify one way you made an excuse today. Take ownership instead.",
    "Say no to one thing you'd normally say yes to. Protect your priorities.",
    "Practice 10 minutes of present-moment awareness. Notice when your mind drifts to past or future.",
    "Identify one person who triggers you. Journal: What trait in them exists in me?",
    "Do a letting-go meditation: Breathe in acceptance, breathe out resistance to what is.",
    "Write about a part of yourself you've rejected. What gift might it offer if integrated?",
    "Spend 15 minutes doing nothing. No phone, no goals. Just exist and observe."
  ]
}
